__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, None, None, 3 0                                            
__________________________________________________________________________________________________
conv2d_1 (Conv2D)               (None, None, None, 1 448         input_1[0][0]                    
__________________________________________________________________________________________________
leaky_re_lu_1 (LeakyReLU)       (None, None, None, 1 0           conv2d_1[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_1 (MaxPooling2D)  (None, None, None, 1 0           leaky_re_lu_1[0][0]              
__________________________________________________________________________________________________
conv2d_2 (Conv2D)               (None, None, None, 3 4640        max_pooling2d_1[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_2 (LeakyReLU)       (None, None, None, 3 0           conv2d_2[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_2 (MaxPooling2D)  (None, None, None, 3 0           leaky_re_lu_2[0][0]              
__________________________________________________________________________________________________
conv2d_3 (Conv2D)               (None, None, None, 6 18496       max_pooling2d_2[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_3 (LeakyReLU)       (None, None, None, 6 0           conv2d_3[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_3 (MaxPooling2D)  (None, None, None, 6 0           leaky_re_lu_3[0][0]              
__________________________________________________________________________________________________
conv2d_4 (Conv2D)               (None, None, None, 1 73856       max_pooling2d_3[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_4 (LeakyReLU)       (None, None, None, 1 0           conv2d_4[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_4 (MaxPooling2D)  (None, None, None, 1 0           leaky_re_lu_4[0][0]              
__________________________________________________________________________________________________
conv2d_5 (Conv2D)               (None, None, None, 2 295168      max_pooling2d_4[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_5 (LeakyReLU)       (None, None, None, 2 0           conv2d_5[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_5 (MaxPooling2D)  (None, None, None, 2 0           leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
conv2d_6 (Conv2D)               (None, None, None, 5 1180160     max_pooling2d_5[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_6 (LeakyReLU)       (None, None, None, 5 0           conv2d_6[0][0]                   
__________________________________________________________________________________________________
max_pooling2d_6 (MaxPooling2D)  (None, None, None, 5 0           leaky_re_lu_6[0][0]              
__________________________________________________________________________________________________
conv2d_7 (Conv2D)               (None, None, None, 1 4719616     max_pooling2d_6[0][0]            
__________________________________________________________________________________________________
leaky_re_lu_7 (LeakyReLU)       (None, None, None, 1 0           conv2d_7[0][0]                   
__________________________________________________________________________________________________
conv2d_8 (Conv2D)               (None, None, None, 2 262400      leaky_re_lu_7[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_8 (LeakyReLU)       (None, None, None, 2 0           conv2d_8[0][0]                   
__________________________________________________________________________________________________
conv2d_11 (Conv2D)              (None, None, None, 1 32896       leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_10 (LeakyReLU)      (None, None, None, 1 0           conv2d_11[0][0]                  
__________________________________________________________________________________________________
up_sampling2d_1 (UpSampling2D)  (None, None, None, 1 0           leaky_re_lu_10[0][0]             
__________________________________________________________________________________________________
concatenate_1 (Concatenate)     (None, None, None, 3 0           up_sampling2d_1[0][0]            
                                                                 leaky_re_lu_5[0][0]              
__________________________________________________________________________________________________
conv2d_9 (Conv2D)               (None, None, None, 5 1180160     leaky_re_lu_8[0][0]              
__________________________________________________________________________________________________
conv2d_12 (Conv2D)              (None, None, None, 2 884992      concatenate_1[0][0]              
__________________________________________________________________________________________________
leaky_re_lu_9 (LeakyReLU)       (None, None, None, 5 0           conv2d_9[0][0]                   
__________________________________________________________________________________________________
leaky_re_lu_11 (LeakyReLU)      (None, None, None, 2 0           conv2d_12[0][0]                  
__________________________________________________________________________________________________
conv2d_10 (Conv2D)              (None, None, None, 2 130815      leaky_re_lu_9[0][0]              
__________________________________________________________________________________________________
conv2d_13 (Conv2D)              (None, None, None, 2 65535       leaky_re_lu_11[0][0]             
__________________________________________________________________________________________________
BoxExtractor_0 (Lambda)         (None, None, 4)      0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
BoxExtractor_1 (Lambda)         (None, None, 4)      0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
ScoreExtractor_0 (Lambda)       (None, None, 80)     0           conv2d_10[0][0]                  
__________________________________________________________________________________________________
ScoreExtractor_1 (Lambda)       (None, None, 80)     0           conv2d_13[0][0]                  
__________________________________________________________________________________________________
concatenate_2 (Concatenate)     (None, None, 4)      0           BoxExtractor_0[0][0]             
                                                                 BoxExtractor_1[0][0]             
__________________________________________________________________________________________________
concatenate_3 (Concatenate)     (None, None, 80)     0           ScoreExtractor_0[0][0]           
                                                                 ScoreExtractor_1[0][0]           
==================================================================================================
Total params: 8,849,182
Trainable params: 8,849,182
Non-trainable params: 0
__________________________________________________________________________________________________
