_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, None, None, 3)     0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, None, None, 16)    432       
_________________________________________________________________
batch_normalization_1 (Batch (None, None, None, 16)    64        
_________________________________________________________________
leaky_re_lu_1 (LeakyReLU)    (None, None, None, 16)    0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, None, None, 16)    0         
_________________________________________________________________
conv2d_2 (Conv2D)            (None, None, None, 32)    4608      
_________________________________________________________________
batch_normalization_2 (Batch (None, None, None, 32)    128       
_________________________________________________________________
leaky_re_lu_2 (LeakyReLU)    (None, None, None, 32)    0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, None, None, 32)    0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, None, None, 64)    18432     
_________________________________________________________________
batch_normalization_3 (Batch (None, None, None, 64)    256       
_________________________________________________________________
leaky_re_lu_3 (LeakyReLU)    (None, None, None, 64)    0         
_________________________________________________________________
max_pooling2d_3 (MaxPooling2 (None, None, None, 64)    0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, None, None, 128)   73728     
_________________________________________________________________
batch_normalization_4 (Batch (None, None, None, 128)   512       
_________________________________________________________________
leaky_re_lu_4 (LeakyReLU)    (None, None, None, 128)   0         
_________________________________________________________________
max_pooling2d_4 (MaxPooling2 (None, None, None, 128)   0         
_________________________________________________________________
conv2d_5 (Conv2D)            (None, None, None, 256)   294912    
_________________________________________________________________
batch_normalization_5 (Batch (None, None, None, 256)   1024      
_________________________________________________________________
leaky_re_lu_5 (LeakyReLU)    (None, None, None, 256)   0         
_________________________________________________________________
max_pooling2d_5 (MaxPooling2 (None, None, None, 256)   0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, None, None, 512)   1179648   
_________________________________________________________________
batch_normalization_6 (Batch (None, None, None, 512)   2048      
_________________________________________________________________
leaky_re_lu_6 (LeakyReLU)    (None, None, None, 512)   0         
_________________________________________________________________
max_pooling2d_6 (MaxPooling2 (None, None, None, 512)   0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, None, None, 1024)  4718592   
_________________________________________________________________
batch_normalization_7 (Batch (None, None, None, 1024)  4096      
_________________________________________________________________
leaky_re_lu_7 (LeakyReLU)    (None, None, None, 1024)  0         
_________________________________________________________________
conv2d_8 (Conv2D)            (None, None, None, 512)   4718592   
_________________________________________________________________
batch_normalization_8 (Batch (None, None, None, 512)   2048      
_________________________________________________________________
leaky_re_lu_8 (LeakyReLU)    (None, None, None, 512)   0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, None, None, 425)   218025    
=================================================================
Total params: 11,237,145
Trainable params: 11,232,057
Non-trainable params: 5,088
_________________________________________________________________
